"""7. Дано рядок. Розріжте його на дві рівні частини (якщо довжина рядка - парна, а якщо довжина
рядка непарна, то довжина першої частини повинна бути на один символ більше). Переставте ці дві
частини місцями, результат запишіть в новий рядок і виведіть на екран.
"""

a = str(input("Введите строку: "))

def ryd(a):
    pol = len(a) // 2
    nex= len(a) % 2
    if nex > 0:
        pol += 1
    x = a[pol:]+a[:pol]
    return x


print(ryd(a))